In [1]:
import pandas as pd

In [2]:
import pandas as pd

dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

# 1. Display top 3 Rows of the Dataset

In [4]:
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

# 2. Check last 3 rows of the dataset

In [5]:
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

# 3. Find shape of our dataset (no of rows and columns)

In [7]:
df1.shape

(7, 3)

In [8]:
print('No of rows', df1.shape[0])
print('No of columns', df1.shape[1])

No of rows 7
No of columns 3

# 4. Get info about our dataset like total number rows, total no of columns, datatypes of each column and memory requirement

In [11]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

# 5. check null values in dataset

In [12]:
df1.isnull()

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

In [13]:
len(df1.isnull())

7

In [18]:
df1.isnull().sum(axis =1)

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

In [19]:
df1.isnull().sum(axis =0)

Name      0
Marks     0
Gender    0
dtype: int64

In [17]:
df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

# 6. get over all stats about dataset

In [21]:
df1.describe()

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [22]:
df1.describe(include = 'all')

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

# 7. find unique values in gender column

In [33]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [24]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [25]:
df1['Gender'].unique

<bound method Series.unique of 0      Male
1    Female
2    Female
3      Male
4      Male
5    Female
6    Female
Name: Gender, dtype: object>

In [32]:
len(df1['Gender'].unique())

2

# 8. find no of unique valeus from gender column

In [35]:
df1['Gender'].nunique()

2

# 9. display count of unique values in gender column

In [36]:
df1['Gender'].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

# 10 . find total no of students having marks btwn 90 to 100 (inclusive ) using between method

In [37]:
df1['Marks']

0    98
1    89
2    99
3    87
4    90
5    83
6    99
Name: Marks, dtype: int64

In [38]:
df1['Marks'] >=90

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [39]:
df1[df1['Marks'] >=90]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [40]:
len(df1[df1['Marks'] >=90])

4

In [43]:
(df1['Marks'] >=90) & (df1['Marks'] <=100)

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [44]:
df1[(df1['Marks'] >=90) & (df1['Marks'] <=100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [45]:
len(df1[(df1['Marks'] >=90) & (df1['Marks'] <=100)])

4

In [46]:
#between method

df1['Marks'].between(90,100)

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [47]:
sum(df1['Marks'].between(90,100))

4

# 11. find avg marks

In [48]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [49]:
df1['Marks'].mean()

92.14285714285714

In [50]:
df1['Marks'].min()

83

In [51]:
df1['Marks'].max()

99

# 12 Apply method

In [52]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [53]:
def marks(x):
    return x/2

In [54]:
df1['Marks'].apply(marks)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [55]:
#create a new column for it

df1['Half_Marks'] = df1['Marks'].apply(marks)

In [56]:
df1

      Name  Marks  Gender  Half_Marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [57]:
#above are float values

def marks(x):
    return x//2

In [59]:
df1['Marks'].apply(marks)

0    49
1    44
2    49
3    43
4    45
5    41
6    49
Name: Marks, dtype: int64

In [60]:
df1['Half_Marks2'] = df1['Marks'].apply(marks)

In [61]:
df1

      Name  Marks  Gender  Half_Marks  Half_Marks2
0  Priyang     98    Male        49.0           49
1   Aadhya     89  Female        44.5           44
2   Krisha     99  Female        49.5           49
3   Vedant     87    Male        43.5           43
4   Parshv     90    Male        45.0           45
5   Mittal     83  Female        41.5           41
6  Archana     99  Female        49.5           49

In [63]:
df1['Marks'].apply(lambda x:x/2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [64]:
df1['Marks'].apply(lambda x:x//2)

0    49
1    44
2    49
3    43
4    45
5    41
6    49
Name: Marks, dtype: int64

In [65]:
df1['Name'].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

# 13. Map function

In [66]:
df1

      Name  Marks  Gender  Half_Marks  Half_Marks2
0  Priyang     98    Male        49.0           49
1   Aadhya     89  Female        44.5           44
2   Krisha     99  Female        49.5           49
3   Vedant     87    Male        43.5           43
4   Parshv     90    Male        45.0           45
5   Mittal     83  Female        41.5           41
6  Archana     99  Female        49.5           49

In [67]:
df1['Gender'].map

<bound method Series.map of 0      Male
1    Female
2    Female
3      Male
4      Male
5    Female
6    Female
Name: Gender, dtype: object>

In [68]:
df1['Gender'].map({'Male': 1, 'Female': 0})

0    1
1    0
2    0
3    1
4    1
5    0
6    0
Name: Gender, dtype: int64

In [70]:
df1['Male_Female'] = df1['Gender'].map({'Male': 1, 'Female': 0})

# DROP the column

In [72]:
df1

      Name  Marks  Gender  Half_Marks  Half_Marks2  Male_Female
0  Priyang     98    Male        49.0           49            1
1   Aadhya     89  Female        44.5           44            0
2   Krisha     99  Female        49.5           49            0
3   Vedant     87    Male        43.5           43            1
4   Parshv     90    Male        45.0           45            1
5   Mittal     83  Female        41.5           41            0
6  Archana     99  Female        49.5           49            0

In [75]:
df1.drop(['Male_Female', 'Half_Marks2'], axis = 1)

      Name  Marks  Gender  Half_Marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [76]:
df1.drop(['Male_Female', 'Half_Marks2'], axis = 1, inplace = True)

In [77]:
df1

      Name  Marks  Gender  Half_Marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

# 15. Print names of columns

In [79]:
df1.columns

Index(['Name', 'Marks', 'Gender', 'Half_Marks'], dtype='object')

In [80]:
df1.index

RangeIndex(start=0, stop=7, step=1)

# 16. sort dataframe as per the marks columns

In [81]:
df1

      Name  Marks  Gender  Half_Marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [83]:
df1.sort_values

<bound method DataFrame.sort_values of       Name  Marks  Gender  Half_Marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5>

In [84]:
df1.sort_values('Marks')

      Name  Marks  Gender  Half_Marks
5   Mittal     83  Female        41.5
3   Vedant     87    Male        43.5
1   Aadhya     89  Female        44.5
4   Parshv     90    Male        45.0
0  Priyang     98    Male        49.0
2   Krisha     99  Female        49.5
6  Archana     99  Female        49.5

In [85]:
df1.sort_values('Marks', ascending = False)

      Name  Marks  Gender  Half_Marks
2   Krisha     99  Female        49.5
6  Archana     99  Female        49.5
0  Priyang     98    Male        49.0
4   Parshv     90    Male        45.0
1   Aadhya     89  Female        44.5
3   Vedant     87    Male        43.5
5   Mittal     83  Female        41.5

In [88]:
df1.sort_values(['Marks', 'Half_Marks'], ascending = False)

      Name  Marks  Gender  Half_Marks
2   Krisha     99  Female        49.5
6  Archana     99  Female        49.5
0  Priyang     98    Male        49.0
4   Parshv     90    Male        45.0
1   Aadhya     89  Female        44.5
3   Vedant     87    Male        43.5
5   Mittal     83  Female        41.5

# 17. Display name & marks of the female students

In [89]:
df1['Gender']

0      Male
1    Female
2    Female
3      Male
4      Male
5    Female
6    Female
Name: Gender, dtype: object

In [90]:
df1['Gender'] == 'Female'

0    False
1     True
2     True
3    False
4    False
5     True
6     True
Name: Gender, dtype: bool

In [92]:
df1[df1['Gender'] == 'Female'][['Name', 'Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [93]:
df1[df1['Gender'] == 'Female']

      Name  Marks  Gender  Half_Marks
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [95]:
df1[df1['Gender'].isin(['Female'])][['Name', 'Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99